georgegrigore06/embedded-multitasker/board/pin_mux.h
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT0_10 (coord B12), LED_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDS_LED_RED_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDS_LED_RED_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITLEDS_LED_RED_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDS_LED_RED_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDS_LED_RED_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDS_LED_RED_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDS_LED_RED_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT0_27 (coord E10), LED_GREEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDS_LED_GREEN_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDS_LED_GREEN_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITLEDS_LED_GREEN_GPIO_PIN 27U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDS_LED_GREEN_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDS_LED_GREEN_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDS_LED_GREEN_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDS_LED_GREEN_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT4_13 (coord T7), SW1
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITBUTTONS_SW1_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITBUTTONS_SW1_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define SHIELD_INITBUTTONS_SW1_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITBUTTONS_SW1_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITBUTTONS_SW1_PIN 13U                   /*!<@brief PORT pin number */
#define SHIELD_INITBUTTONS_SW1_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitButtons(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT2_7 (coord L2), D8
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITLEDS_D8_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITLEDS_D8_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define SHIELD_INITLEDS_D8_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define SHIELD_INITLEDS_D8_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITLEDS_D8_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITLEDS_D8_PIN 7U                   /*!<@brief PORT pin number */
#define SHIELD_INITLEDS_D8_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT2_5 (coord K1), D7
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITLEDS_D7_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITLEDS_D7_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define SHIELD_INITLEDS_D7_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define SHIELD_INITLEDS_D7_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITLEDS_D7_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITLEDS_D7_PIN 5U                   /*!<@brief PORT pin number */
#define SHIELD_INITLEDS_D7_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT2_2 (coord H3), D6
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITLEDS_D6_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITLEDS_D6_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define SHIELD_INITLEDS_D6_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define SHIELD_INITLEDS_D6_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITLEDS_D6_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITLEDS_D6_PIN 2U                   /*!<@brief PORT pin number */
#define SHIELD_INITLEDS_D6_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT2_4 (coord K3), D5
  @{ */

