georgegrigore06/embedded-multitasker/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define SHIELD_INITLEDS_D5_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITLEDS_D5_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define SHIELD_INITLEDS_D5_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define SHIELD_INITLEDS_D5_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITLEDS_D5_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITLEDS_D5_PIN 4U                   /*!<@brief PORT pin number */
#define SHIELD_INITLEDS_D5_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT4_12 (coord T6), D1
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITLEDS_D1_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITLEDS_D1_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define SHIELD_INITLEDS_D1_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define SHIELD_INITLEDS_D1_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITLEDS_D1_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITLEDS_D1_PIN 12U                   /*!<@brief PORT pin number */
#define SHIELD_INITLEDS_D1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT0_14 (coord E11), D4
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITLEDS_D4_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITLEDS_D4_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define SHIELD_INITLEDS_D4_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define SHIELD_INITLEDS_D4_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITLEDS_D4_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITLEDS_D4_PIN 14U                   /*!<@brief PORT pin number */
#define SHIELD_INITLEDS_D4_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT0_15 (coord G13), D3
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITLEDS_D3_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITLEDS_D3_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define SHIELD_INITLEDS_D3_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define SHIELD_INITLEDS_D3_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITLEDS_D3_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITLEDS_D3_PIN 15U                   /*!<@brief PORT pin number */
#define SHIELD_INITLEDS_D3_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT0_22 (coord B8), D2
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITLEDS_D2_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITLEDS_D2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define SHIELD_INITLEDS_D2_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define SHIELD_INITLEDS_D2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITLEDS_D2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITLEDS_D2_PIN 22U                   /*!<@brief PORT pin number */
#define SHIELD_INITLEDS_D2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitLEDs(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitADC(void);

#define ICR_IRQS_irqs0 0x00u /*!<@brief Interrupt Select: Interrupt, trigger output, or DMA request 0 */
#define PCR_IBE_ibe1 0x01u   /*!<@brief Input Buffer Enable: Enables */
#define PCR_INV_inv0 0x00u   /*!<@brief Invert Input: Does not invert */
#define PCR_SRE_sre0 0x00u   /*!<@brief Slew Rate Enable: Fast */

/*! @name PORT2_0 (coord H2), SW_DIP_1
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITDIPSWITCH_SW_DIP_1_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITDIPSWITCH_SW_DIP_1_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define SHIELD_INITDIPSWITCH_SW_DIP_1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITDIPSWITCH_SW_DIP_1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITDIPSWITCH_SW_DIP_1_PIN 0U                   /*!<@brief PORT pin number */
#define SHIELD_INITDIPSWITCH_SW_DIP_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT1_22 (coord L4), SW_DIP_2
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITDIPSWITCH_SW_DIP_2_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITDIPSWITCH_SW_DIP_2_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define SHIELD_INITDIPSWITCH_SW_DIP_2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITDIPSWITCH_SW_DIP_2_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITDIPSWITCH_SW_DIP_2_PIN 22U                   /*!<@brief PORT pin number */
#define SHIELD_INITDIPSWITCH_SW_DIP_2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT2_3 (coord J3), SW_DIP_3
  @{ */

