georgegrigore06/embedded-multitasker/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define SHIELD_INITDIPSWITCH_SW_DIP_3_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITDIPSWITCH_SW_DIP_3_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define SHIELD_INITDIPSWITCH_SW_DIP_3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITDIPSWITCH_SW_DIP_3_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITDIPSWITCH_SW_DIP_3_PIN 3U                   /*!<@brief PORT pin number */
#define SHIELD_INITDIPSWITCH_SW_DIP_3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitDIPSwitch(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2C(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT3_21 (coord L16), SW6_A
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITROTARYENCODER_SW6_A_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITROTARYENCODER_SW6_A_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define SHIELD_INITROTARYENCODER_SW6_A_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITROTARYENCODER_SW6_A_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITROTARYENCODER_SW6_A_PIN 21U                   /*!<@brief PORT pin number */
#define SHIELD_INITROTARYENCODER_SW6_A_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT3_19 (coord K17), SW6_B
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITROTARYENCODER_SW6_B_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITROTARYENCODER_SW6_B_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define SHIELD_INITROTARYENCODER_SW6_B_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITROTARYENCODER_SW6_B_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITROTARYENCODER_SW6_B_PIN 19U                   /*!<@brief PORT pin number */
#define SHIELD_INITROTARYENCODER_SW6_B_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT0_31 (coord D7), SW6_C
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITROTARYENCODER_SW6_C_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITROTARYENCODER_SW6_C_GPIO_PIN 31U              /*!<@brief GPIO pin number */
#define SHIELD_INITROTARYENCODER_SW6_C_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITROTARYENCODER_SW6_C_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITROTARYENCODER_SW6_C_PIN 31U                   /*!<@brief PORT pin number */
#define SHIELD_INITROTARYENCODER_SW6_C_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitRotaryEncoder(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT3_18 (coord K16), NAV_SW1
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITJOYSTICK_NAV_SW1_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW1_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define SHIELD_INITJOYSTICK_NAV_SW1_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITJOYSTICK_NAV_SW1_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW1_PIN 18U                   /*!<@brief PORT pin number */
#define SHIELD_INITJOYSTICK_NAV_SW1_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT2_6 (coord K2), NAV_SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITJOYSTICK_NAV_SW2_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW2_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define SHIELD_INITJOYSTICK_NAV_SW2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITJOYSTICK_NAV_SW2_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW2_PIN 6U                   /*!<@brief PORT pin number */
#define SHIELD_INITJOYSTICK_NAV_SW2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT0_30 (coord E7), NAV_SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITJOYSTICK_NAV_SW3_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW3_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define SHIELD_INITJOYSTICK_NAV_SW3_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITJOYSTICK_NAV_SW3_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW3_PIN 30U                   /*!<@brief PORT pin number */
#define SHIELD_INITJOYSTICK_NAV_SW3_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_23 (coord M4), NAV_SW4
  @{ */

