georgegrigore06/embedded-multitasker/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define SHIELD_INITJOYSTICK_NAV_SW4_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW4_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define SHIELD_INITJOYSTICK_NAV_SW4_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITJOYSTICK_NAV_SW4_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW4_PIN 23U                   /*!<@brief PORT pin number */
#define SHIELD_INITJOYSTICK_NAV_SW4_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_17 (coord K15), NAV_SW6
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_INITJOYSTICK_NAV_SW6_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW6_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define SHIELD_INITJOYSTICK_NAV_SW6_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_INITJOYSTICK_NAV_SW6_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_INITJOYSTICK_NAV_SW6_PIN 17U                   /*!<@brief PORT pin number */
#define SHIELD_INITJOYSTICK_NAV_SW6_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitJoystick(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
